import React, { useEffect, useState } from 'react'
import Modal from 'react-modal'

import mwStyle from '../ModalWindow.scss'

import s from './AgeNotify.scss'

const AgeNotify = () => {
  const [opened, setOpened] = useState(false)

  useEffect(() => {
    if (window.localStorage.getItem('18plus')) {
      setOpened(false)
    } else {
      setOpened(true)
    }
  }, [])
  return (
    <Modal
      style={{
        overlay: {
          backgroundColor: 'rgba(0, 0, 0, 0.3)',
        },
      }}
      closeTimeoutMS={300}
      isOpen={opened}
      className={`${mwStyle.modal_window} ${mwStyle.white_modal} ${mwStyle.not_full}`}
    >
      <div className={s.inner_content}>
        <div className={s.img_block}>
          <svg
            width="130"
            height="130"
            viewBox="0 0 130 130"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g clipPath="url(#clip0)">
              <path
                d="M41.1258 87.1379V51.8438H32.9668V42.7993H52.3844V87.1379H41.1258Z"
                fill="#1A3D4A"
              />
              <path
                d="M94.6955 54.2471C94.6955 58.1053 92.6084 61.5207 89.1297 63.4185C93.9994 65.442 97.0357 69.6801 97.0357 74.6134C97.0357 82.5827 89.9515 87.643 78.8831 87.643C67.8143 87.643 60.7305 82.646 60.7305 74.8036C60.7305 69.7433 64.0194 65.442 69.1425 63.4185C65.4108 61.3309 63.0074 57.7894 63.0074 53.9313C63.0074 46.8467 69.2061 42.3564 78.8199 42.3564C88.5601 42.3564 94.6955 46.9736 94.6955 54.2471ZM71.3562 73.6651C71.3562 77.3971 74.013 79.4843 78.8831 79.4843C83.7532 79.4843 86.4729 77.4608 86.4729 73.6651C86.4729 69.9971 83.7532 67.9091 78.8831 67.9091C74.0126 67.9091 71.3562 69.9967 71.3562 73.6651ZM72.495 54.8796C72.495 58.0428 74.772 59.813 78.8831 59.813C82.9942 59.813 85.2712 58.0424 85.2712 54.8796C85.2712 51.5915 82.9942 49.7569 78.8831 49.7569C74.7716 49.7569 72.495 51.5915 72.495 54.8796Z"
                fill="#1A3D4A"
              />
              <path
                d="M115.771 47.8046C117.643 53.3289 118.592 59.107 118.592 65.0002C118.592 94.5498 94.5517 118.59 65.0018 118.59C35.4518 118.59 11.4107 94.5498 11.4107 65.0002C11.4107 35.4498 35.4514 11.41 65.0014 11.41C70.8953 11.41 76.6734 12.3587 82.197 14.2312V2.3054C76.6177 0.775977 70.8554 0 65.0018 0C29.161 0 0.00195312 29.159 0.00195312 65.0002C0.00195312 100.841 29.161 130 65.0018 130C100.843 130 130.001 100.841 130.001 65.0002C130.001 59.147 129.226 53.3843 127.696 47.8046H115.771Z"
                fill="#1A3D4A"
              />
              <path
                d="M112.527 17.4371V4.97363H103.565V17.4371H91.1758V26.3986H103.565V38.8616H112.527V26.3986H124.989V17.4371H112.527Z"
                fill="#1A3D4A"
              />
            </g>
            <defs>
              <clipPath id="clip0">
                <rect width="130" height="130" fill="white" />
              </clipPath>
            </defs>
          </svg>
        </div>
        <div className={s.title}>Подтвердите что вам больше 18 лет</div>
        <div className={s.subtitle}>
          Просмотр данного сайта разрешен только лицам, достигшим возраста в 18 лет. Сайт содержит
          информацию и изображения табачных изделий и куриносительных принадлежностей. Нажав на
          кнопку “Продолжить” Вы подтверждаете свое совершеннолетие и принимаете условия{' '}
          <a href="/files/term.pdf">пользовательского соглашения</a>
        </div>
        <div className={s.links}>
          <button
            type="button"
            className={s.back}
            onClick={() => {
              window.history.back()
            }}
          >
            <svg
              width="32"
              height="24"
              viewBox="0 0 32 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M21.5484 1.08815C21.1125 0.636958 20.3869 0.636958 19.9357 1.08815C19.4998 1.5241 19.4998 2.24966 19.9357 2.68459L28.1131 10.8619H1.12899C0.499968 10.8629 0 11.3629 0 11.9919C0 12.621 0.499968 13.1372 1.12899 13.1372H28.1131L19.9357 21.2993C19.4998 21.7505 19.4998 22.477 19.9357 22.912C20.3869 23.3632 21.1135 23.3632 21.5484 22.912L31.6616 12.7988C32.1128 12.3628 32.1128 11.6373 31.6616 11.2023L21.5484 1.08815Z"
                fill="black"
              />
            </svg>
            <span>Назад</span>
          </button>
          <button
            type="button"
            className={s.forward}
            onClick={() => {
              window.localStorage.setItem('18plus', '1')
              setOpened(false)
            }}
          >
            <span>Продолжить</span>
            <svg
              width="32"
              height="24"
              viewBox="0 0 32 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M21.5484 1.08815C21.1125 0.636958 20.3869 0.636958 19.9357 1.08815C19.4998 1.5241 19.4998 2.24966 19.9357 2.68459L28.1131 10.8619H1.12899C0.499968 10.8629 0 11.3629 0 11.9919C0 12.621 0.499968 13.1372 1.12899 13.1372H28.1131L19.9357 21.2993C19.4998 21.7505 19.4998 22.477 19.9357 22.912C20.3869 23.3632 21.1135 23.3632 21.5484 22.912L31.6616 12.7988C32.1128 12.3628 32.1128 11.6373 31.6616 11.2023L21.5484 1.08815Z"
                fill="black"
              />
            </svg>
          </button>
        </div>
      </div>
    </Modal>
  )
}

export default AgeNotify
